app/views/wizards/new.html.erb

SELECT "wizards".* FROM "wizards"
---
    <%= label_tag 'name'%><%=f.text_field :name %><br>
    <%= label_tag 'house'%><%=f.select :house, Wizard.houses.map {|house| house}%><br>