app/views/wizards/show.html.erb

<!-- <h3>Spells:</h3> <br><br> -->
<% @wizard.spells.each do |spell| %>
---
SELECT "spells".* FROM "spells" INNER JOIN "favorite_spells" ON "spells"."id" = "favorite_spells"."spell_id" WHERE "favorite_spells"."wizard_id" = ?  [["wizard_id", 1]]