app/views/spells/show.html.erb


<ul><%@spell.wizards.each do |wizard| %>
---
SELECT "wizards".* FROM "wizards" INNER JOIN "favorite_spells" ON "wizards"."id" = "favorite_spells"."wizard_id" WHERE "favorite_spells"."spell_id" = ?  [["spell_id", 89]]