app/controllers/favorite_spells_controller.rb

    def new
        @wizard = Wizard.find(params[:id])
        @favorite_spell = FavoriteSpell.new
        @spells = Spell.all.reject{|spell| @wizard.spells.include?(spell)}
---
SELECT  "wizards".* FROM "wizards" WHERE "wizards"."id" = ? LIMIT ?  [["id", 65], ["LIMIT", 1]]
SELECT  "wizards".* FROM "wizards" WHERE "wizards"."id" = ? LIMIT ?  [["id", 0], ["LIMIT", 1]]
SELECT  1 AS one FROM "spells" INNER JOIN "favorite_spells" ON "spells"."id" = "favorite_spells"."spell_id" WHERE "favorite_spells"."wizard_id" = ? AND "spells"."id" = ? LIMIT ?  [["wizard_id", 65], ["id", 89], ["LIMIT", 1]]
SELECT "spells".* FROM "spells"

    def create
        favorite_spell = FavoriteSpell.new(favorite_spell_params)
        favorite_spell.save
---
INSERT INTO "favorite_spells" ("wizard_id", "spell_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["wizard_id", 65], ["spell_id", 90], ["created_at", "2019-09-25 03:13:31.178302"], ["updated_at", "2019-09-25 03:13:31.178302"]]