app/controllers/spells_controller.rb

SELECT "spells".* FROM "spells"
---
    def index
        @spells = Spell.all

SELECT  "spells".* FROM "spells" WHERE "spells"."id" = ? LIMIT ?  [["id", 89], ["LIMIT", 1]]
---
    def show
        @spell = Spell.find(params[:id])

INSERT INTO "spells" ("name", "description", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", "Habanero"], ["description", "Super spicy chilli spell"], ["created_at", "2019-09-25 02:52:05.148472"], ["updated_at", "2019-09-25 02:52:05.148472"]]
---
    def create
        spell = Spell.new(spell_params)
        spell.save