app/controllers/wizards_controller.rb

SELECT "wizards".* FROM "wizards"
---
  def index
    @wizards = Wizard.all

SELECT  "wizards".* FROM "wizards" WHERE "wizards"."id" = ? LIMIT ?  [["id", 53], ["LIMIT", 1]]
---
  def show
    @wizard = Wizard.find(params[:id])

INSERT INTO "wizards" ("name", "house", "age", "created_at", "updated_at", "image") VALUES (?, ?, ?, ?, ?, ?)
---
  def create
    wizard = Wizard.new(wizard_params)
    ##space for validation##
    wizard.save

SELECT  "wizards".* FROM "wizards" WHERE "wizards"."id" = ? LIMIT ?  [["id", 53], ["LIMIT", 1]]
---
  def edit
    @wizard = Wizard.find(params[:id])

SELECT  "wizards".* FROM "wizards" WHERE "wizards"."id" = ? LIMIT ?  [["id", 60], ["LIMIT", 1]]
UPDATE "wizards" SET "house" = ?, "updated_at" = ? WHERE "wizards"."id" = ?  [["house", "Slytherin"], ["updated_at", "2019-09-25 02:16:34.460920"], ["id", 60]]
---
  def update
    wizard = Wizard.find(params[:id])
    wizard.update(wizard_params)

SELECT  "wizards".* FROM "wizards" WHERE "wizards"."id" = ? LIMIT ?  [["id", 60], ["LIMIT", 1]]
DELETE FROM "wizards" WHERE "wizards"."id" = ?  [["id", 3]]
DELETE FROM "favorite_spells" WHERE "favorite_spells"."id" = ?  [["id", 64]]
DELETE FROM "wizards" WHERE "wizards"."id" = ?  [["id", 60]]
---
  def destroy
    @wizard = Wizard.find(params[:id])
    @wizard.favorite_spells.destroy_all
    @wizard.destroy

SELECT  "wizards".* FROM "wizards" WHERE "wizards"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
---
  def favorite_spell
    @wizard = Wizard.find(params[:id])