app/views/favorite_spells/new.html.erb

  <%= f.hidden_field :wizard_id, :value => @wizard.id %>
  <%= f.collection_select :spell_id, Spell.all, :id, :name %> <br>
---
SELECT "spells".* FROM "spells"